const WORD_INDEX = '*ABCDEFGHIJKLMNOPQRSTUVWXYZアイウエオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモヤユヨラリルレロワヲンー';
const CONVERT = [
    ['ァ', 'ア'],
    ['ィ', 'イ'],
    ['ゥ', 'ウ'],
    ['ェ', 'エ'],
    ['ォ', 'オ'],
    ['ッ', 'ツ'],
    ['ャ', 'ヤ'],
    ['ュ', 'ユ'],
    ['ョ', 'ヨ'],
    ['ヮ', 'ワ'],
    ['え', 'エ'],
    ['ほ', 'ホ'],
    ['ん', 'ン']
];

function zeroPadding(num, length) {
    return ('0000000000' + num).slice(-length);
}

function word_to_index(s) {
    let r = '';
    for (let i = 0, len = s.length; i < len; ++i) {
        let w = s[i];
        if (w === 'x') {
            r += '99';
        } else {
            for (let n = 0, len = CONVERT.length; n < len; ++n) {
                if (w === CONVERT[n][0]) {
                    w = CONVERT[n][1];
                    break
                }
            }
            let idx = WORD_INDEX.indexOf(w);
            if (idx >= 0) {
                r += zeroPadding(idx, 2)
            } else {
                r += '00';
                console.log('invalid word index:' + w)
            }
        }
    }
    return r;
}

function normalize_no(before, nos, is_end) {
    let f = 0;
    let ndc = null;
    let _before = before.trim();
    let _after = '';
    if (_before.length > 0) f++;
    if (nos.length >= 2) {
        if (nos[1].trim().length > 0) {
            _after += nos[1].trim()
        }
    }
    let m = nos[0].trim().match(/^([0-9]{1,3})?(\.[0-9]*)?(.*)$/);
    if (m) {
        _after = m[3] + _after;
        if (m[2] && m[2].indexOf('.') !== -1) {
            if (is_end && _after.length === 0) {
                ndc = (('000' + m[1]).slice(-3) + m[2] + '9999').slice(0, 8)
            } else {
                ndc = (('000' + m[1]).slice(-3) + m[2] + '0000').slice(0, 8)
            }
        } else if (m[1] && m[1].length > 0) {
            if (is_end && _after.length === 0) {
                ndc = (m[1] + '999').slice(0, 3) + '.9999'
            } else {
                ndc = (m[1] + '000').slice(0, 3) + '.0000'
            }
        }
    }
    if (ndc === null) {
        ndc = '000.0000';
        f += 2;
    }
    _before = word_to_index((_before + '***').slice(0, 3));
    _after = word_to_index((_after + (is_end ? 'xxxxxx' : '******')).slice(0, 6));
    let r = _before + zeroPadding(f, 1) + ndc + _after;
    if (r.length !== 27) {
        console.log('invalid length:' + r);
    }
    return r;
}

function normalize_no_simple(before, nos) {
    let f = 0;
    let ndc = null;
    let _before = before.trim();
    let _after = '';
    if (_before.length > 0) f++;
    if (nos.length >= 2) {
        if (nos[1].trim().length > 0) {
            _after += nos[1].trim()
        }
    }
    let m = nos[0].trim().match(/^([0-9]{1,3})?(\.[0-9]*)?(.*)$/);
    if (m) {
        _after = m[3] + _after;
        if (m[2] && m[2].indexOf('.') !== -1) {
            ndc = (('000' + m[1]).slice(-3) + m[2] + '0000').slice(0, 8)
        } else if (m[1] && m[1].length > 0) {
            ndc = zeroPadding(parseInt(m[1]), 3) + '.0000'
        }
    }
    if (ndc === null) {
        ndc = '000.0000';
        f += 2;
    }
    _before = word_to_index((_before + '***').slice(0, 3));
    _after = word_to_index((_after + '******').slice(0, 6));
    let r = _before + zeroPadding(f, 1) + ndc + _after;
    if (r.length !== 27) {
        console.log('invalid length:' + r);
    }
    return r;
}


function decode_tables(rules) {
    let tables = [];
    let ls = rules.split('\n');
    for (let i = 0, len = ls.length; i < len; ++i) {
        let line = ls[i].trim();
        if (line) {
            let p = line.split('\t');
            if (p.length === 3 || p.length === 4) {
                let t = p[2].split('/');
                let start = normalize_no(t[0], t.slice(1));
                if (p.length === 4) {
                    t = p[3].split('/');
                }
                let end = normalize_no(t[0], t.slice(1), true);
                tables.push({
                    'name': p[0].trim(),
                    'place': p[1].trim(),
                    'start': start,
                    'end': end
                })
            } else if (p.length === 2) {
                tables.push({
                    'name': p[0].trim(),
                    'place': p[1].trim(),
                    'start': null,
                    'end': null
                })
            } else {
                throw new Error("invalid rules.");
            }
        }
    }
    return tables;
}

class ShelfFinder {
    constructor(rules) {
        this.tables = decode_tables(rules);
    }

    find(place, before, nos) {
        let v = normalize_no_simple(before, nos);
        let r = [];
        for (let i = 0, len = this.tables.length; i < len; ++i) {
            let re = new RegExp(this.tables[i].place, "g");
            if (place.search(re) !== -1) {
                if (this.tables[i].start === null || (v >= this.tables[i].start && v <= this.tables[i].end)) {
                    if (r.indexOf(this.tables[i].name) === -1) {
                        r.push(this.tables[i].name)
                    }
                }
            }
        }
        return r;
    }
}


let rules = `
おとな5	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/000	/199
おとな6	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/200	/210
おとな6	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/220	/279
おとな6	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/302	/304
おとな7	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/211	/219
おとな7	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/280	/288
おとな7	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/290	/299
おとな7	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	B/
おとな8	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/300	/301
おとな8	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/308	/361
おとな9	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/361	/383.8
おとな10	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/383.8	/399
おとな10	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/500	/587
おとな11	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/588	/597
おとな11	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	B/000	B/999
おとな11	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/N
おとな12	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	B/
おとな13	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	B/
おとな13	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/760	/769
おとな13	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/780	/789
おとな14	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/400	/489
おとな14	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/645	/649
おとな15	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/367.7
おとな15	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/369.26
おとな15	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/493.7	/490
おとな15	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/494	/499
おとな15	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/598	/599
おとな16	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Nア	/Nタ
おとな16	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/385
おとな16	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/800	/899
おとな17	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/NN
おとな17	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Nチ	/Nワ
おとな17	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fア
おとな17	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eア
おとな18	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eア	/Eカ
おとな18	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fア	/Fカ
おとな19	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eカ	/Eシ
おとな19	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fカ	/Fシ
おとな20	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eシ	/Eナ
おとな20	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fシ	/Fナ
おとな21	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eナ	/Eミ
おとな21	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fナ	/Fミ
おとな22	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Eミ	/Eワ
おとな22	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/Fミ	/Fワ
おとな23	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/908
おとな23	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/912	/917
おとな23	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/918
おとな23	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/918.6
おとな23	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/920	/999
おとな24	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/901	/910.268
おとな24	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/911	/911.56
おとな24	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/600	/669
おとな25	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/670	/699
おとな25	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/701	/709
おとな26	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/710	/725
おとな27	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/726
おとな27	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/728	/730
おとな27	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/750	/752
おとな28	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/753	/759
おとな28	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/770	/777
おとな29	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/778	/779
おとな30	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/740	/749
おとな30	^一般成人書$|^参考資料$|^郷土資料$|^文庫$	/794	/799
こども1	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Nハ	/Nワ
こども2	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/200	/299
こども2	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/300	/385
こども2	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/389	/399
こども3	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/400	/486
こども4	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/487	/499
こども4	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/500	/639
こども5	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/000	/199
こども5	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/640	/899
こども6	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/386	/388
こども6	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/900	/999
こども7	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Nア	/Nエ
こども7	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Nス	/Nワ
こども8	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Nア	/Nハ
こども9	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/えほんス	/えほんモ
こども10	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/えほんク	/えほんシ
こども11	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/えほんオ	/えほんキ
こども12	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/えほんア	/えほんオ
こども12	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/えほんヤ	/えほんワ
こども12	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fア	/Fエ
こども13	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fオ	/Fス
こども14	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fセ	/Fト
こども15	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fナ	/Fニ
こども16	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fヌ	/Fフ
こども17	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fフ	/Fム
こども18	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/Fム	/Fワ
こども19	^児童書$|^児童参考$|^昔話絵本$|^知識絵本$|^別置絵本$|^幼児絵本$|^平和絵本$	/ライトノベル
書庫	^庫般$|^庫2$|^庫児$|^庫郷$|^庫壁$|^庫雑$
`;

let x = new ShelfFinder(rules);
console.log(x.find('一般成人書', '', ['F', 'シン']));
